Revit 2024 API
IFCFile.GetInstanceCount Method
 Counts IFC instances of one particular type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int GetInstanceCount(
	string entityName,
	bool includeSubTypes
)
Visual Basic
Public Function GetInstanceCount ( _
	entityName As String, _
	includeSubTypes As Boolean _
) As Integer
Visual C++
public:
int GetInstanceCount(
	String^ entityName,
	bool includeSubTypes
)
Parameters
entityName
Type: System.String
 The name of the instance type.
includeSubTypes
Type: System.Boolean
 True to count instances of sub types.
Return Value
 The count.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace